import BoxContent from "../../TextAnimations/BoxContent";
import HeadingSubHead from "../../TextAnimations/HeadingSubHead";
import React from 'react';

const Info = () => {

    // karjokromList
    const activityHeading = 'আমাদের কার্যক্রম :';
    const activityLists = [
        "বিবাহ, তালাক ও দাম্পত্য জীবনের শরয়ী পরামর্শ প্রদান",
        "উলামায়ে কেরামের মাধ্যমে নির্ভরযোগ্য ও নিরাপদ নিকাহ ব্যবস্থাপনা",
        "পাত্র-পাত্রীর বৈধ পরিচয় ও সার্টিফিকেশন যাচাই",
        "নিজস্ব কাজী সাহেব এবং উকিল দ্বারা কাবিন নামা / কোর্ট ম্যারেজের বৈধভাবে সরকারি রেজিষ্ট্রেশন করানো",
        "বিবাহের দাওয়াতী মেহনত ও জনসচেতনতা তৈরি",
        "দ্রুত বিবাহ ও একাধিক বিবাহকে সহজ করা ও সমাজের নেতিবাচক দৃষ্টিভঙ্গি দূরীকরণ",
        "বিধবা, তালাকপ্রাপ্ত ও এতিম নারীদের বিবাহের সুব্যবস্থা করা",
        "প্রবাসী ও স্থানীয় পাত্রদের জন্য উপযুক্ত সমাধান প্রদান",
        "শরয়ী অভিভাবকত্ব ও ওয়াকিলের মাধ্যমে নারীদের নিরাপত্তা নিশ্চিতকরণ",
        "এতিম, অসহায়, অভিভাবকহীন নারীদের বিশেষ সুযোগ সুবিধা প্রদান।",
        "গোনাহ থেকে বাঁচতে চাওয়া এরকম আল্লাহ ওয়ালা মুত্তাকী যুবকদের জন্য বিশেষ সুযোগ সুবিধার মাধ্যমে তাদের বিবাহের ব্যাবস্থা করা। (প্রয়োজনে তাদের অভিভাবকত্বের ব্যাবস্থা করা এবং উত্তম রিজিকের ব্যাবস্থা করে দেওয়া)",
        "যে সকল পিতা মাতা/অভিভাবক বিভিন্ন আর্থিক,সামাজিক সমস্যার কারণে তাদের অধীনস্ত ছেলে-মেয়েদের বিবাহের ব্যাবস্থা করে দিতে পারতেছেন না, তাদেরকে TMS থেকে বিশেষ সুযোগ সুবিধা প্রদানের মাধ্যমে বিবাহের ব্যাবস্থা করে দেওয়া।",
    ];


    // ইসলামে বিবাহের গুরুত্ব ও ফজিলত
    const importanceHeading = 'ইসলামে বিবাহের গুরুত্ব ও ফজিলত';
    const importanceSubHeading = 'বিবাহ একটি ইবাদত এবং এটি আল্লাহর বিধান। কুরআন ও হাদিসে বিবাহের গুরুত্ব ও ফজিলত সম্পর্কে বহু দলিল রয়েছে:';
    const importanceLists = [
        'النكاح سنتي – "বিবাহ আমার সুন্নাত।" (ইবনে মাজাহ: ১৮৪৬)',
        'وَأَنْكِحُوا الْأَيَامَىٰ مِنْكُمْ – "তোমাদের মধ্যে যারা অবিবাহিত, তাদের বিবাহ সম্পন্ন করো।" (সূরা নূর: ৩২)',
        'إذا تزوج العبد فقد استكمل نصف الدين – "যখন বান্দা বিবাহ করে, তখন সে তার দ্বীনের অর্ধেক পূর্ণ করে।" (বায়হাকি, শু‘আবুল ঈমান: ৫৪৭৬)',
        'خيرُ النِّكاحِ أيْسَرُهُ – "সর্বোত্তম বিবাহ হলো যা সবচেয়ে সহজে সম্পন্ন হয়।" (ইবনে হিব্বান: ৪০৩২)'
    ];

    // কেনো অধিক বিবাহ ইসলামে প্রয়োজনীয়?
    const whyImportantHeading = 'কেনো অধিক বিবাহ ইসলামে প্রয়োজনীয়?';
    const whyImportantSubHeading = 'কেনো অধিক বিবাহ ইসলামে প্রয়োজনীয়?';
    const whyImportantLists = [
        'فَانْكِحُوا مَا طَابَ لَكُمْ مِنَ النِّسَاءِ مَثْنَىٰ وَثُلَاثَ وَرُبَاعَ "তোমরা নারীদের মধ্যে যার সাথে বিবাহ করতে চাও, তাদের মধ্যে দুই, তিন বা চার পর্যন্ত বিবাহ করো।" (সূরা নিসা: ৩)',
        '"তোমাদের উত্তম স্ত্রীরাই জান্নাতে তোমাদের সঙ্গী হবে।" (তিরমিজি: ১১৮৩)',
        '"আমার উম্মতের মধ্যে যে বেশি সন্তান জন্ম দেবে, আমি কিয়ামতের দিন তার মাধ্যমে গর্ব করব।" (আবু দাউদ: ২০৫০)'
    ];


    // অধিক বিবাহের উপকারিতা
    const manyMarrigeHeading = 'অধিক বিবাহের উপকারিতা';
    const manyMarrigeSubHeading = 'অধিক বিবাহের উপকারিতা ও ফজিলত:';
    const manyMarrigeLists = [
        'সমাজে নারীদের জন্য নিরাপদ ও বৈধ জীবনসঙ্গীর ব্যবস্থা নিশ্চিত করা',
        'জিনাহ ও অবৈধ সম্পর্ক থেকে সমাজকে রক্ষা করা',
        'উম্মতের বংশ বৃদ্ধি ও শক্তিশালী করা',
        'বিধবা ও তালাকপ্রাপ্ত নারীদের জন্য পুনরায় বিবাহের সুযোগ তৈরি করা',
        'সংসার জীবনে অধিক সুখ, শান্তি ও বরকত নিশ্চিত করা'
    ];


    // কেনো TMS-এর মাধ্যমে বিবাহ করবেন?
    const whyChooseTMSHeading = 'কেনো HMS-এর মাধ্যমে বিবাহ করবেন?';
    const whyChooseTMSSubHeading = 'আমাদের মাধ্যমে বিবাহ করলে আপনি যা যা সুবিধা পাবেন:';
    const whyChooseTMSLists = [
        '২৪ ঘণ্টার মধ্যে ফিডব্যাক পাওয়ার নিশ্চয়তা',
        'পুরুষ নারীকে এবং নারীও পুরুষকে প্রস্তাব পাঠাতে পারবেন',
        'অফিসে না আসতে পারলেও অনলাইনে রেজিস্ট্রেশন ও ভেরিফিকেশন সুবিধা',
        'প্রত্যেক প্রস্তাবের জন্য আলাদা ফি লাগবে না, বরং মাসিক প্যাকেজের মাধ্যমে সুবিধা গ্রহণ করা যাবে',
        'শুধুমাত্র রেজিস্ট্রেশন ফি দিয়েই প্রাথমিকভাবে বিনামূল্যে প্রস্তাব পাঠানোর সুযোগ',
        'নারী-পুরুষ উভয়ের জন্য ক্যাটাগরিভিত্তিক পাত্র-পাত্রীর তথ্য বিশ্লেষণের সুবিধা',
        'বিশেষভাবে গোপনীয়তা রক্ষার নিশ্চয়তা',
        'HMS-এর মাধ্যমে স্বল্প খরচে শরিয়তসম্মত সুন্নাহ মোতাবেক বিবাহের সুযোগ',
        'HMS-এর ওয়েবসাইটে পুরুষ ও নারীদের সিভি আলাদা আলাদা ক্যাটাগরাইজ অনুযায়ী হওয়ার কারণে খোঁজখুজির ঝামেলা থেকে মুক্ত।'
    ];

    // বিবাহ প্রক্রিয়া ও শর্তাবলী
    const termsHeading = 'বিবাহ প্রক্রিয়া ও শর্তাবলী';
    const termsSubHeading = 'HMS-এর মাধ্যমে বিবাহ বন্ধনে আবদ্ধ হতে হলে:';
    const termsLists = [
        'নির্দিষ্ট রেজিস্ট্রেশন ফি পরিশোধ করে আবেদন করতে হবে। পুরুষ সদস্যদের জন্য রেজিষ্ট্রেশন ফী মাত্র ১০০০ টাকা (অফার মূল্য ৫০০ টাকা, এটি আগামী ঈদুল আজহা পর্যন্ত বহাল থাকবে), মহিলা সদস্যদের জন্য ঈদুল আজহা পর্যন্ত সম্পূর্ণ ফ্রী রেজিষ্ট্রেশন। তাছাড়াও দুঃস্থ অসহায়, আর্থিকভাবে অস্বচ্ছল দ্বীনদার পুরুষদের জন্য রেজিষ্ট্রেশন সম্পূর্ণ ফ্রী থাকবে ইনশাআল্লাহ।',
        'বিবাহের জন্য নির্ধারিত শর্তাবলী পূরণ করে ফরম জমা দিতে হবে।',
        'প্রত্যেক আবেদন যাচাই-বাছাই করে অনুমোদিত হলে বিবাহ প্রক্রিয়া শুরু হবে।'
    ];
    // অফিস টাইম
    const officeTimeSubHeading = 'অফিস টাইম';
    const officeTimeLists = [
        'প্রতিদিন সকাল  ০৯ টা থেকে রাত ০৯ টা পর্যন্ত।',
        'সপ্তাহে সোমবার ব্যাতিত বাকি ৬ দিনই অফিস খোলা থাকিবে।'
    ];


    return (
        <div className="py-10 px-5 md:py-14 md:px-16 lg:py-16 lg:px-28 min-h-[100dvh] bg-[#F9F6EE]">


            <div className=" lg:p-20 shadow-xl md:p-10 rounded-xl">

                <div className=" border-thin rounded-xl p-5 md:p-8 lg:p-10">

                    {/* Heading */}
                    <div className="text-center space-y-10">
                        <HeadingSubHead heading={'🌿 মুহতারাম ও মুহতারামা!'} subHeading={'HMS কোনো সাধারণ ঘটকালি প্রতিষ্ঠান নয়। এটি ইসলামী শরিয়াহ-সম্মত দাওয়াতী প্ল্যাটফর্ম, যেখানে বিবাহ, তালাক ও দাম্পত্য জীবনের শরয়ী সমাধান প্রদান করা হয়। আমরা কেবল বিবাহ সম্পন্ন করাই না, বরং একটি সুখী, বরকতময় ও টেকসই দাম্পত্য জীবন গঠনে সহায়তা করি। আমাদের লক্ষ্য ইসলামী অনুশাসন মেনে বিবাহকে সহজ করা, হারাম থেকে বাঁচানো এবং সুন্নাহ অনুযায়ী পরিবার গঠন করা।'} />
                    </div>

                    {/* আমাদের কার্যক্রম */}
                    <div className="my-10">
                        <BoxContent lists={activityLists} heading={activityHeading} />
                    </div>


                    {/* ইসলামে বিবাহের গুরুত্ব ও ফজিলত */}
                    <div className="space-y-10 my-24">
                        <HeadingSubHead heading={importanceHeading} />
                        <BoxContent heading={importanceSubHeading} lists={importanceLists} />
                    </div>


                    {/* কেনো অধিক বিবাহ ইসলামে প্রয়োজনীয়? */}
                    <div className="my-24 space-y-5">
                        <HeadingSubHead heading={whyImportantHeading} />
                        <BoxContent heading={whyImportantSubHeading} lists={whyImportantLists} />
                    </div>


                    {/* অধিক বিবাহের উপকারিতা */}
                    <div className="my-24 space-y-5">
                        <HeadingSubHead heading={manyMarrigeHeading} />
                        <BoxContent heading={manyMarrigeSubHeading} lists={manyMarrigeLists} />
                    </div>


                    {/*  কেনো TMS-এর মাধ্যমে বিবাহ করবেন? */}
                    <div className="my-24 space-y-5">
                        <HeadingSubHead heading={whyChooseTMSHeading} />
                        <BoxContent heading={whyChooseTMSSubHeading} lists={whyChooseTMSLists} />
                    </div>


                    {/* বিবাহ প্রক্রিয়া ও শর্তাবলী */}
                    <div className="space-y-5">
                        <HeadingSubHead heading={termsHeading} />
                        <BoxContent heading={termsSubHeading} lists={termsLists} />
                        <p className="text-red-600 text-center font-bold">HMS-এর একটাই মেইন অফিস, আর কোথায়  কোনো শাখা নেই।</p>
                        <BoxContent heading={officeTimeSubHeading} lists={officeTimeLists} />
                    </div>



                </div>

            </div>

        </div>
    );
};

export default Info;