import React from 'react';
import useRole from '../../Hooks/Role/useRole';
import { Link } from 'react-router-dom';
import WhiteButton from '../Shared/Buttons/WhiteButton';
import BlackButton from '../Shared/Buttons/BlackButton';
import useAuth from '../../Hooks/Auth/useAuth';

const GuestAndNotVerf = () => {

    const { gender } = useRole();
    const { user } = useAuth();
    console.log(user);

    return (
        <div>
            <div className="space-y-1 mt-5 pb-5">
                <h1 className="font-galada text-xl font-semibold">মুহতারাম  </h1>
                <p className="font-galada text-xl font-semibold">আসসালামু আলাইকুম ওয়ারাহমাতুল্লাহ।</p>
                <p className="font-alkatra">HMS কোনো সাধারণ ঘটকালি প্রতিষ্ঠান নয়। এটি ইসলামী শরিয়াহ-সম্মত দাওয়াতী প্ল্যাটফর্ম, যেখানে বিবাহ, তালাক ও দাম্পত্য জীবনের শরয়ী সমাধান প্রদান করা হয়। <br />
                    আমরা কেবল বিবাহ সম্পন্ন করাই না, বরং একটি সুখী, বরকতময় ও টেকসই দাম্পত্য জীবন গঠনে সহায়তা করি। আমাদের লক্ষ্য ইসলামী অনুশাসন মেনে বিবাহকে সহজ করা, হারাম থেকে বাঁচানো এবং সুন্নাহ অনুযায়ী পরিবার গঠন করা।</p>
                <p className="font-alkatra">
                    আপনি যদি Heaven Marriage Solution (HMS) এর একজন আদর্শ সদস্য হয়ে  HMS  থেকে বিবাহ সংক্রান্ত যেকোনো সেবা গ্রহণ করতে চান অথবা HMS এর মাধ্যমে আপনার মন মতো দ্বীনদার  পাত্রীকে মাসনা, সুলাছা, রুবা’আ বা ওয়াহেদা হিসেবে বিবাহ করতে চান, তাহলে আল্লাহকে সাক্ষী রেখে পূর্ণ আমানতের সাথে নিম্নের ফরমটি ভালোভাবে পুরণ করে সাবমিট করুন এবং পরবর্তী নির্দেশনাগুলো ফলো করুন। ফরমটি পূরণ করার আগে HMS সম্পর্কে বিস্তারিত জানতে HMS এর নিজস্ব ফেইসবুক পেইজ Heaven Marriage Solution থেকে আমাদের আপলোড করা পিনপোস্ট অথবা আমাদের হোয়াটসঅ্যাপ নাম্বারে যোগাযোগ করে  নিয়মকানূনগুলো ভালো করে বুঝে শুনে  সিদ্ধান্ত নিন।
                </p>

                <ul>
                    <li className="font-mina list-disc ml-16"> প্রত্যেকটি প্রশ্নের স্পষ্ট এবং সত্য  উত্তর দিতে হবে।  Required বা ★ স্টার চিহ্নিত  প্রশ্নের উত্তর অবশ্যই দিতে হবে,   উত্তর না দিলে ফরমটি গ্ৰহণযোগ্য হবে না ।</li>
                    <li className="font-mina list-disc ml-16">ফরমটি সাবমিট করার পর অফিসিয়াল চার্জ প্রদান করতে হবে। রেজিস্ট্রেশন চার্জ: ১০০০ টাকা।
                        (আগামী ঈদুল আজহা পর্যন্ত ৫০% ডিসকাউন্টে মাত্র ৫০০ টাকা)।</li>
                </ul>
            </div>

            <div className="space-y-1">
                <p className="font-semibold font-galada">দেশ ও প্রবাসের আবেদনকারীদের জন্য বিশেষ ঘোষণা:</p>
                <p className="font-alkatra">মুহতারাম! সরাসরি সাক্ষাৎ করা ছাড়া সদস্যপদ চূড়ান্ত করা হয় না। আপনি চাইলে আপাতত অনলাইন ফরমটি সাবমিট করে এন্ট্রি ফি জমা দিয়ে আবেদন করে রাখতে পারেন। <br />
                    এরপর যেদিন অফিসে আসার সুযোগ হবে, অফিসিয়াল নাম্বার থেকে সিডিউল নিয়ে সরাসরি সাক্ষাৎ করবেন।</p>
                <p className="font-alkatra">ভেরিফিকেশন কমপ্লিট হলে সদস্য হিসেবে গ্ৰহণ করা হবে, এবং  HMS এর  গ্ৰুপে জয়েন্ট করানো হবে। সেখান থেকে বায়োডাটা দেখে পাত্রীদের ব্যাপারে প্রস্তাব পাঠাতে পারবেন।
                    (  একান্তই ব্যাক্তিগত কোনো সমস্যার  কারণে সরাসরী সাক্ষাৎ করতে না পারলে অথবা সাক্ষাৎ করতে না চাইলে আমাদের হোয়াটসঅ্যাপ নাম্বারে না আসতে পারার কারণসমুহ উল্লেখ করে ম্যাসেজ করুন,আমরা যথাসম্ভব দ্রুত আপনার কার্জক্রম সম্পন্ন করার চেষ্টা করবো।</p>
                <p className="font-alkatra">কোনো সমস্যা না থাকলে অবশ্যই অফিসে এসে ভেরিফিকেশন সম্পন্ন করতে হবে, অন্যথায় আপনার আইডি ভেরিফাই করা হবে না)  ।</p>
                <p className="font-alkatra">টাকা পাঠানোর পর রিপ্লাই মেসেজে উল্লেখ করা হোয়াটসঅ্যাপ নাম্বারে স্ক্রিনশট পাঠাবেন।</p>

                <p className="text-red-800 font-alkatra">👉যে নাম্বারে বা একাউন্টে টাকা পাঠাবেন</p>
                <p><span className="font-semibold font-alkatra">সেন্ডমানি:</span> <span className="font-bold text-red-800">01748919251</span> (নগদ/বিকাশ/রকেট- পার্সোনাল)</p>
                <p className="font-alkatra">মুহতারাম! আপনার যদি HMS-র সকল আদর্শ ও কার্যক্রম পছন্দ হয় এবং সকল নিয়মকানূন মানতে রাজি থাকেন, তাহলে ফরমটি পূরণ করুন।</p>
            </div>


            <div className="space-y-2">
                <p className="text-center font-semibold font-galada text-xl">প্রথমে অনলাইন ফর্মটি সাবমিট করুন।</p>
                <p className="font-alkatra">উল্লেখিত নাম্বার বা একাউন্টে ভেরিফিকেশন চার্জ পরিশোধ করে হোয়াটসঅ্যাপে স্কিনশর্ট পাঠান।
                    শিডিউল নিয়ে সরাসরি অফিসে সাক্ষাৎ করে সদস্যপদ সম্পন্ন করুন। সদস্যপদ চুড়ান্ত হওয়ার পর আপনাকে HMS-র  ওয়েবসাইট একসেস দেওয়া হবে, ফলে আপনি সহজেই আপনার পছন্দমতো মোহতারামের সাথে আমাদের মাধ্যমে  প্রস্তাব আদান প্রদানসহ যোগাযোগ করতে পারবেন।</p>

                <p className="font-semibold font-galada text-xl pt-5">⭐ বিশেষ সুবিধা ঘোষণা ⭐</p>
                <p className="font-alkatra">আগামী ঈদুল আজহা পর্যন্ত মহিলাদের জন্য ১০০% ডিসকাউন্টে  সম্পূর্ন  ফ্রী </p>
                <p className="font-alkatra">আমরা আপনার সুবিধা ও সময়ের মূল্য বিবেচনায় আমাদের অফিসে সরাসরি এসে ভেরিফিকেশন করার কোনো বাধ্যবাধকতা রাখিনি। তবে আপনি যদি স্বয়ং অফিসে এসে দেখা করেন, কিংবা আপনার অভিভাবক বা প্রতিনিধি পাঠান—তাহলে সেটি আপনার জন্যই অধিক কল্যাণকর হবে, ইনশাআল্লাহ। এতে আমাদের মধ্যে একটি আস্থার বন্ধন গড়ে উঠবে, যা সামনের পথে চলতে সহায়ক হবে।</p>
                <p className="font-alkatra">তবে ফরমটি সাবমিট করার পর, তা এপ্রুভের পূর্বে আপনাকে হোয়াটসঅ্যাপের মাধ্যমে ভার্চুয়ালি ভেরিফাই করা হবে। তাই বিনীত অনুরোধ—ফরম সাবমিশনের পর যেন আপনি হোয়াটসঅ্যাপে সক্রিয় থাকেন, যাতে দ্রুত ও সহজভাবে প্রক্রিয়াটি সম্পন্ন করা যায়।</p>
                <p className="font-alkatra">হোয়াটসঅ্যাপের মাধ্যমে  আপনার ভেরিফিকেশন কমপ্লিট হলে সদস্য হিসেবে গ্ৰহণ করা হবে, এবং  HMS এর  গ্ৰুপে জয়েন্ট করানো হবে। সেখান থেকে পাত্রদের বায়োডাটা দেখে যেকোনো পাত্রের ব্যাপারে প্রস্তাব পাঠাতে পারবেন।</p>
                <p className="font-semibold font-galada text-xl">টাকা পাঠানোর পর রিপ্লাই মেসেজে উল্লেখ করা হোয়াটসঅ্যাপ নাম্বারে স্ক্রিনশট পাঠাবেন।</p>
            </div>

            <div className='flex justify-center pb-5'>
                {gender === 'male' && <Link to='/men_form'><WhiteButton text='পুরুষ ফর্ম' /></Link>}
                {gender === 'female' && <Link to='/woman_form'><BlackButton text='মহিলা ফর্ম' /></Link>}
                {!gender && <div className='flex justify-center mb-5 gap-5'>
                    <Link to='/men_form'><WhiteButton text='পুরুষ ফর্ম' /></Link>
                    <Link to='/woman_form'><BlackButton text='মহিলা ফর্ম' /></Link>
                </div>}
            </div>


        </div>
    );
};

export default GuestAndNotVerf;